{
  "site": [
    "При разработке акцент делаем на Вас как на владельце бизнеса (личный бренд) или на самом бизнесе?",
    "Какова основная цель сайта? (Что клиент должен сделать: позвонить, оставить заявку, купить товар, подписаться, перейти в соцсети?)",
    "Какие стоят основные задачи в маркетинге? Что нужно рекламировать (демонстрировать на сайте) в первую очередь?",
    "Какие услуги Вы оказываете или какие товары продаете? Если есть перечень основных, напишите.",
    "Кто ваша целевая аудитория? (Опишите своего идеального клиента: пол, возраст, интересы, боли).",
    "Напишите пару предложений о себе и/или о своем бизнесе, которые можно было бы использовать на сайте.",
    "Есть ли что-то, что можно дать посетителю сайта в подарок (гайд, чек-лист, скидка, сертификат)? Если есть, пришлите ссылку или файл.",
    "Укажите ссылки на свои соц.сети, сайты, контакты, адрес офиса и т.д. для размещения на сайте.",
    "Нужно ли будет размещать: отзывы, дипломы/сертификаты, лицензии?",
    "Есть ли у вас готовый контент для сайта? (Тексты, фото, видео). Если нет, кто будет его готовить?",
    "В каких цветах Вы хотели бы видеть сайт? Напишите 3 цвета (один - основной и 2 дополнительных).",
    "Есть ли у Вас брендбук?",
    "Есть ли у Вас логотип?",
    "Есть ли пример дизайна сайта, который вам нравится? Пришлите ссылку на него.",
    "Какие чувства или эмоции должен вызывать сайт? (Доверие, легкость, технологичность, роскошь, креативность?)",
    "Предполагается ли на сайте размещение товаров, оформление заявок на них и прием оплаты?",
    "Нужна ли интеграция сторонних сервисов: CRM систем, сервисов гугл/яндекс (календари, таблицы...) и др.",
    "Нужна ли адаптивная верстка под ПК или достаточно только мобильной версии сайта?",
    "Планируете ли вы покупать собственное доменное имя или вас устроит составное доменное имя предоставляемое сервисом (https://taplink.cc/вашеИмя)?",
    "Каковы сроки и бюджет проекта?",
    "Любая дополнительная информация, которую вы хотели бы указать."
  ],
  "bot": [
    "Какова основная цель бота? (Автоматизация продаж, ответы на FAQ, генерация лидов, поддержка клиентов, развлечение?)",
    "В какой соц.сети/мессенджере должен работать бот?",
    "Опишите подробно функционал бота.",
    "Если есть пример бота со схожим функционалом, который вас удовлетворяет, пришлите ссылку.",
    "Опишите пошаговый сценарий идеального взаимодействия пользователя с ботом.",
    "Выберите тип разработки бота: конструктор, программируемый.",
    "Должен ли бот вести и хранить базу данных пользователей?",
    "Должен ли бот собирать статистику обращений?",
    "Нужно ли разграничение доступа к функционалу бота (административный и пользовательские режимы)?",
    "Нужна ли интеграция со сторонними сервисами: CRM, сервисы гугл/яндекс, нейросети и др.",
    "Нужен ли встроенный ИИ-агент?",
    "Нужна ли возможность подключения живого оператора? Если да, то при каких условиях?",
    "Как бот должен реагировать на нестандартные вопросы/сообщения?",
    "Нужна ли многоязычность бота?",
    "Если бот в Telegram, нужен ли Telegram Web App (мини-приложение внутри бота для сложных интерфейсов)?",
    "Есть ли особые требования к безопасности хранения данных пользователей?",
    "Кто будет наполнять бота контентом? (Тексты ответов, кнопки, медиафайлы). У вас есть готовые тексты?",
    "Потребуется ли техническая поддержка бота после разработки (обновление контента, настроек, анализ эффективности)?",
    "Каковы сроки и бюджет проекта?",
    "Предполагается ли дальнейшее развитие функционала бота? (Это поможет заложить масштабируемую архитектуру и избежать дорогостоящих переделок в будущем)."
  ],
  "other": [
    "Опишите задачу, которую необходимо сделать.",
    "Какова цель дизайна? (Что он должен помочь достичь: увеличить продажи, проинформировать, повысить узнаваемость?)",
    "Где именно будет использоваться этот продукт? (Карточка товара на Wildberries, презентация для инвесторов, баннер для рекламы, сертификат для печати?)",
    "Кто является вашей целевой аудиторией для этого продукта?",
    "При разработке акцент делаем на Вас как на владельце бизнеса (личный бренд) или на самом бизнесе?",
    "В каких цветах Вы хотели бы видеть продукт? Напишите 3 цвета (один - основной и 2 дополнительных).",
    "Какой стиль дизайна вы предпочитаете? (Минимализм, классика, ретро, технологичный и т.д.)",
    "Напишите текст, который необходимо разместить, или ссылку на текстовые материалы.",
    "Если есть пример подобного продукта с дизайном, который вам нравится, пришлите ссылку.",
    "Кто ваши конкуренты? Пришлите примеры их материалов, которые вам нравятся/не нравятся и почему.",
    "Есть ли обязательные элементы к размещению? (Логотип, контакты, QR-коды, юридическая информация и т.д.)",
    "Нужна ли адаптация одного макета под разные форматы? (Например, один баннер для Stories, один для ленты и т.д.)",
    "Каковы сроки сдачи проекта и бюджет?",
    "Сколько вариантов дизайна и правок вы ожидаете?"
  ]
}