structure_menu = {
    'Основное меню': [
        '🌐 Опрос "создание сайта"',
        '🤖 Опрос "создание бота',
        '🖼 Опрос "другое"',
        '🔎 Примеры работ',
        '👨🏻‍💻 Чат с администратором',
        'ℹ️ О нас'
    ]

    }
HELP_TEXT = """
📖 **Как пользоваться ботом**

Добро пожаловать!  
Мы занимаемся **логистикой оптовых партий товаров с заводов Китая**, а также предлагаем **широкий ассортимент электроники и не только** по **низким ценам**.

---

🔽 **Как начать:**

1. **📋 Каталоги товаров и цен**  
Получите доступ к полному списку товаров и актуальным ценам. Ознакомьтесь с каталогами и выберите понравившиеся позиции.
Каталоги представлены в виде ссылок на гугл таблицы.

2. **📦 Закупка оптом**  
После выбора товара из каталога с помощью подразделов в меню:
- выберите категорию товара,  
- укажите бренд и модель,  
- добавьте примерное количество.  
Мы получим вашу заявку, и администратор свяжется с вами в ближайшее время для уточнения деталей.

3. **👨🏻‍💻 Чат с администратором**  
Хотите задать вопрос напрямую? Используйте эту кнопку, чтобы сразу перейти в чат с админом.

---

ℹ️ **Дополнительные разделы:**

- **🚚 Вопросы по логистике** — вся информация по доставке.  
- **💰 Вопросы по оплате** — всё об условиях и способах оплаты.

---

🤖 **Встроенный AI-ассистент**

Бот оснащён **AI-ассистентом**, который ответит на ваши вопросы прямо в чате. Просто отправьте сообщение — он поможет!

---

🚨 **Обратите внимание!**  
В боте работает **антиспам-система**.  
Чтобы бот работал стабильно, количество действий одного пользователя ограничено.
"""
