structure_menu = {
    'Основное меню': {
        '🌐 Опрос "создание сайта"': {
            '1 вопрос': "При разработке акцент делаем на Вас как на владельце бизнеса (личный бренд) или на самом бизнесе?",
            '2 вопрос': "Какова основная цель сайта? (Что клиент должен сделать: позвонить, оставить заявку, купить товар, подписаться, перейти в соцсети?)",
            '3 вопрос': "Какие стоят основные задачи в маркетинге? Что нужно рекламировать (демонстрировать на сайте) в первую очередь?",
            '4 вопрос': "Какие услуги Вы оказываете или какие товары продаете? Если есть перечень основных, напишите.",
            '5 вопрос': "Кто ваша целевая аудитория? (Опишите своего идеального клиента: пол, возраст, интересы, боли).",
            '6 вопрос': "Напишите пару предложений о себе и/или о своем бизнесе, которые можно было бы использовать на сайте.",
            '7 вопрос': "Есть ли что-то, что можно дать посетителю сайта в подарок (гайд, чек-лист, скидка, сертификат)? Если есть, пришлите ссылку или файл.",
            '8 вопрос': "Укажите ссылки на свои соц.сети, сайты, контакты, адрес офиса и т.д. для размещения на сайте.",
            '9 вопрос': "Нужно ли будет размещать: отзывы, дипломы/сертификаты, лицензии?",
            '10 вопрос': "Есть ли у вас готовый контент для сайта? (Тексты, фото, видео). Если нет, кто будет его готовить?",
            '11 вопрос': "В каких цветах Вы хотели бы видеть сайт? Напишите 3 цвета (один - основной и 2 дополнительных).",
            '12 вопрос': "Есть ли у Вас брендбук?",
            '13 вопрос': "Есть ли у Вас логотип?",
            '14 вопрос': "Есть ли пример дизайна сайта, который вам нравится? Пришлите ссылку на него.",
            '15 вопрос': "Какие чувства или эмоции должен вызывать сайт? (Доверие, легкость, технологичность, роскошь, креативность?)",
            '16 вопрос': "Предполагается ли на сайте размещение товаров, оформление заявок на них и прием оплаты?",
            '17 вопрос': "Нужна ли интеграция сторонних сервисов: CRM систем, сервисов гугл/яндекс (календари, таблицы...) и др.",
            '18 вопрос': "Нужна ли адаптивная верстка под ПК или достаточно только мобильной версии сайта?",
            '19 вопрос': "Планируете ли вы покупать собственное доменное имя или вас устроит составное доменное имя предоставляемое сервисом (https://taplink.cc/вашеИмя)?",
            '20 вопрос': "Каковы сроки и бюджет проекта?",
            '21 вопрос': "Любая дополнительная информация, которую вы хотели бы указать."
        },
        '🤖 Опрос "создание бота"': {
            '1 вопрос': "Какова основная цель бота? (Автоматизация продаж, ответы на FAQ, генерация лидов, поддержка клиентов, развлечение?)",
            '2 вопрос': "В какой соц.сети/мессенджере должен работать бот?",
            '3 вопрос': "Опишите подробно функционал бота.",
            '4 вопрос': "Если есть пример бота со схожим функционалом, который вас удовлетворяет, пришлите ссылку.",
            '5 вопрос': "Опишите пошаговый сценарий идеального взаимодействия пользователя с ботом.",
            '6 вопрос': "Выберите тип разработки бота: конструктор, программируемый.",
            '7 вопрос': "Должен ли бот вести и хранить базу данных пользователей?",
            '8 вопрос': "Должен ли бот собирать статистику обращений?",
            '9 вопрос': "Нужно ли разграничение доступа к функционалу бота (административный и пользовательские режимы)?",
            '10 вопрос': "Нужна ли интеграция со сторонними сервисами: CRM, сервисы гугл/яндекс, нейросети и др.",
            '11 вопрос': "Нужен ли встроенный ИИ-агент?",
            '12 вопрос': "Нужна ли возможность подключения живого оператора? Если да, то при каких условиях?",
            '13 вопрос': "Как бот должен реагировать на нестандартные вопросы/сообщения? (переключение на оператора, возвращение в меню..)",
            '14 вопрос': "Нужна ли многоязычность бота?",
            '15 вопрос': "Если бот в Telegram, нужен ли Telegram Web App (мини-приложение внутри бота для сложных интерфейсов)?",
            '16 вопрос': "Есть ли особые требования к безопасности хранения данных пользователей?",
            '17 вопрос': "Кто будет наполнять бота контентом? (Тексты ответов, кнопки, медиафайлы). У вас есть готовые тексты?",
            '18 вопрос': "Потребуется ли техническая поддержка бота после разработки (обновление контента, настроек, анализ эффективности)?",
            '19 вопрос': "Каковы сроки и бюджет проекта?",
            '20 вопрос': "Предполагается ли дальнейшее развитие функционала бота? (Это поможет заложить масштабируемую архитектуру и избежать дорогостоящих переделок в будущем)."
        },
        '🖼 Опрос "другое"': {
            '1 вопрос': "Опишите задачу, которую необходимо сделать.",
            '2 вопрос': "Какова цель дизайна? (Что он должен помочь достичь: увеличить продажи, проинформировать, повысить узнаваемость?)",
            '3 вопрос': "Где именно будет использоваться этот продукт? (Карточка товара на Wildberries, презентация для инвесторов, баннер для рекламы, сертификат для печати?)",
            '4 вопрос': "Кто является вашей целевой аудиторией для этого продукта?",
            '5 вопрос': "При разработке акцент делаем на Вас как на владельце бизнеса (личный бренд) или на самом бизнесе?",
            '6 вопрос': "В каких цветах Вы хотели бы видеть продукт? Напишите 3 цвета (один - основной и 2 дополнительных).",
            '7 вопрос': "Какой стиль дизайна вы предпочитаете? (Минимализм, классика, ретро, технологичный и т.д.)",
            '8 вопрос': "Напишите текст, который необходимо разместить, или ссылку на текстовые материалы.",
            '9 вопрос': "Если есть пример подобного продукта с дизайном, который вам нравится, пришлите ссылку.",
            '10 вопрос': "Кто ваши конкуренты? Пришлите примеры их материалов, которые вам нравятся/не нравятся и почему.",
            '11 вопрос': "Есть ли обязательные элементы к размещению? (Логотип, контакты, QR-коды, юридическая информация и т.д.)",
            '12 вопрос': "Нужна ли адаптация одного макета под разные форматы? (Например, один баннер для Stories, один для ленты и т.д.)",
            '13 вопрос': "Каковы сроки сдачи проекта и бюджет?",
            '14 вопрос': "Сколько вариантов дизайна и правок вы ожидаете?"
        },
        '🔎 Примеры работ':[],
        '👨🏻‍💻 Чат с администратором':[],
        'ℹ️ О нас':[]
    }

    }
HELP_TEXT = """
📖 **Как пользоваться ботом**

Добро пожаловать!  
Мы занимаемся **логистикой оптовых партий товаров с заводов Китая**, а также предлагаем **широкий ассортимент электроники и не только** по **низким ценам**.

---

🔽 **Как начать:**

1. **📋 Каталоги товаров и цен**  
Получите доступ к полному списку товаров и актуальным ценам. Ознакомьтесь с каталогами и выберите понравившиеся позиции.
Каталоги представлены в виде ссылок на гугл таблицы.

2. **📦 Закупка оптом**  
После выбора товара из каталога с помощью подразделов в меню:
- выберите категорию товара,  
- укажите бренд и модель,  
- добавьте примерное количество.  
Мы получим вашу заявку, и администратор свяжется с вами в ближайшее время для уточнения деталей.

3. **👨🏻‍💻 Чат с администратором**  
Хотите задать вопрос напрямую? Используйте эту кнопку, чтобы сразу перейти в чат с админом.

---

ℹ️ **Дополнительные разделы:**

- **🚚 Вопросы по логистике** — вся информация по доставке.  
- **💰 Вопросы по оплате** — всё об условиях и способах оплаты.

---

🤖 **Встроенный AI-ассистент**

Бот оснащён **AI-ассистентом**, который ответит на ваши вопросы прямо в чате. Просто отправьте сообщение — он поможет!

---

🚨 **Обратите внимание!**  
В боте работает **антиспам-система**.  
Чтобы бот работал стабильно, количество действий одного пользователя ограничено.
"""


questions = {
    "site": [
        "При разработке акцент делаем на Вас как на владельце бизнеса (личный бренд) или на самом бизнесе?",
        "Какова основная цель сайта? (Что клиент должен сделать: позвонить, оставить заявку, купить товар, подписаться, перейти в соцсети?)",
        "Какие стоят основные задачи в маркетинге? Что нужно рекламировать (демонстрировать на сайте) в первую очередь?",
        "Какие услуги Вы оказываете или какие товары продаете? Если есть перечень основных, напишите.",
        "Кто ваша целевая аудитория? (Опишите своего идеального клиента: пол, возраст, интересы, боли).",
        "Напишите пару предложений о себе и/или о своем бизнесе, которые можно было бы использовать на сайте.",
        "Есть ли что-то, что можно дать посетителю сайта в подарок (гайд, чек-лист, скидка, сертификат)? Если есть, пришлите ссылку или файл.",
        "Укажите ссылки на свои соц.сети, сайты, контакты, адрес офиса и т.д. для размещения на сайте.",
        "Нужно ли будет размещать: отзывы, дипломы/сертификаты, лицензии?",
        "Есть ли у вас готовый контент для сайта? (Тексты, фото, видео). Если нет, кто будет его готовить?",
        "В каких цветах Вы хотели бы видеть сайт? Напишите 3 цвета (один - основной и 2 дополнительных).",
        "Есть ли у Вас брендбук?",
        "Есть ли у Вас логотип?",
        "Есть ли пример дизайна сайта, который вам нравится? Пришлите ссылку на него.",
        "Какие чувства или эмоции должен вызывать сайт? (Доверие, легкость, технологичность, роскошь, креативность?)",
        "Предполагается ли на сайте размещение товаров, оформление заявок на них и прием оплаты?",
        "Нужна ли интеграция сторонних сервисов: CRM систем, сервисов гугл/яндекс (календари, таблицы...) и др.",
        "Нужна ли адаптивная верстка под ПК или достаточно только мобильной версии сайта?",
        "Планируете ли вы покупать собственное доменное имя или вас устроит составное доменное имя предоставляемое сервисом (https://taplink.cc/вашеИмя)?",
        "Каковы сроки и бюджет проекта?",
        "Любая дополнительная информация, которую вы хотели бы указать."
    ],
    "bot": [
        "Какова основная цель бота? (Автоматизация продаж, ответы на FAQ, генерация лидов, поддержка клиентов, развлечение?)",
        "В какой соц.сети/мессенджере должен работать бот?",
        "Опишите подробно функционал бота.",
        "Если есть пример бота со схожим функционалом, который вас удовлетворяет, пришлите ссылку.",
        "Опишите пошаговый сценарий идеального взаимодействия пользователя с ботом.",
        "Выберите тип разработки бота: конструктор, программируемый.",
        "Должен ли бот вести и хранить базу данных пользователей?",
        "Должен ли бот собирать статистику обращений?",
        "Нужно ли разграничение доступа к функционалу бота (административный и пользовательские режимы)?",
        "Нужна ли интеграция со сторонними сервисами: CRM, сервисы гугл/яндекс, нейросети и др.",
        "Нужен ли встроенный ИИ-агент?",
        "Нужна ли возможность подключения живого оператора? Если да, то при каких условиях?",
        "Как бот должен реагировать на нестандартные вопросы/сообщения? (переключение на оператора, возвращение в меню..)",
        "Нужна ли многоязычность бота?",
        "Если бот в Telegram, нужен ли Telegram Web App (мини-приложение внутри бота для сложных интерфейсов)?",
        "Есть ли особые требования к безопасности хранения данных пользователей?",
        "Кто будет наполнять бота контентом? (Тексты ответов, кнопки, медиафайлы). У вас есть готовые тексты?",
        "Потребуется ли техническая поддержка бота после разработки (обновление контента, настроек, анализ эффективности)?",
        "Каковы сроки и бюджет проекта?",
        "Предполагается ли дальнейшее развитие функционала бота? (Это поможет заложить масштабируемую архитектуру и избежать дорогостоящих переделок в будущем)."
    ],
    "other": [
        "Опишите задачу, которую необходимо сделать.",
        "Какова цель дизайна? (Что он должен помочь достичь: увеличить продажи, проинформировать, повысить узнаваемость?)",
        "Где именно будет использоваться этот продукт? (Карточка товара на Wildberries, презентация для инвесторов, баннер для рекламы, сертификат для печати?)",
        "Кто является вашей целевой аудиторией для этого продукта?",
        "При разработке акцент делаем на Вас как на владельце бизнеса (личный бренд) или на самом бизнесе?",
        "В каких цветах Вы хотели бы видеть продукт? Напишите 3 цвета (один - основной и 2 дополнительных).",
        "Какой стиль дизайна вы предпочитаете? (Минимализм, классика, ретро, технологичный и т.д.)",
        "Напишите текст, который необходимо разместить, или ссылку на текстовые материалы.",
        "Если есть пример подобного продукта с дизайном, который вам нравится, пришлите ссылку.",
        "Кто ваши конкуренты? Пришлите примеры их материалов, которые вам нравятся/не нравятся и почему.",
        "Есть ли обязательные элементы к размещению? (Логотип, контакты, QR-коды, юридическая информация и т.д.)",
        "Нужна ли адаптация одного макета под разные форматы? (Например, один баннер для Stories, один для ленты и т.д.)",
        "Каковы сроки сдачи проекта и бюджет?",
        "Сколько вариантов дизайна и правок вы ожидаете?"
    ]
}